MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1402-Q064X0128/mcu.h
/* ---------------------------------  MATH_EVIER  --------------------------------- */
#define MATH_EVIER_DIVEOCIEN_Pos              (0UL)                     /*!< MATH EVIER: DIVEOCIEN (Bit 0)                               */
#define MATH_EVIER_DIVEOCIEN_Msk              (0x1UL)                   /*!< MATH EVIER: DIVEOCIEN (Bitfield-Mask: 0x01)                 */
#define MATH_EVIER_DIVERRIEN_Pos              (1UL)                     /*!< MATH EVIER: DIVERRIEN (Bit 1)                               */
#define MATH_EVIER_DIVERRIEN_Msk              (0x2UL)                   /*!< MATH EVIER: DIVERRIEN (Bitfield-Mask: 0x01)                 */
#define MATH_EVIER_CDEOCIEN_Pos               (2UL)                     /*!< MATH EVIER: CDEOCIEN (Bit 2)                                */
#define MATH_EVIER_CDEOCIEN_Msk               (0x4UL)                   /*!< MATH EVIER: CDEOCIEN (Bitfield-Mask: 0x01)                  */
#define MATH_EVIER_CDERRIEN_Pos               (3UL)                     /*!< MATH EVIER: CDERRIEN (Bit 3)                                */
#define MATH_EVIER_CDERRIEN_Msk               (0x8UL)                   /*!< MATH EVIER: CDERRIEN (Bitfield-Mask: 0x01)                  */

/* ----------------------------------  MATH_EVFR  --------------------------------- */
#define MATH_EVFR_DIVEOC_Pos                  (0UL)                     /*!< MATH EVFR: DIVEOC (Bit 0)                                   */
#define MATH_EVFR_DIVEOC_Msk                  (0x1UL)                   /*!< MATH EVFR: DIVEOC (Bitfield-Mask: 0x01)                     */
#define MATH_EVFR_DIVERR_Pos                  (1UL)                     /*!< MATH EVFR: DIVERR (Bit 1)                                   */
#define MATH_EVFR_DIVERR_Msk                  (0x2UL)                   /*!< MATH EVFR: DIVERR (Bitfield-Mask: 0x01)                     */
#define MATH_EVFR_CDEOC_Pos                   (2UL)                     /*!< MATH EVFR: CDEOC (Bit 2)                                    */
#define MATH_EVFR_CDEOC_Msk                   (0x4UL)                   /*!< MATH EVFR: CDEOC (Bitfield-Mask: 0x01)                      */
#define MATH_EVFR_CDERR_Pos                   (3UL)                     /*!< MATH EVFR: CDERR (Bit 3)                                    */
#define MATH_EVFR_CDERR_Msk                   (0x8UL)                   /*!< MATH EVFR: CDERR (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  MATH_EVFSR  --------------------------------- */
#define MATH_EVFSR_DIVEOCS_Pos                (0UL)                     /*!< MATH EVFSR: DIVEOCS (Bit 0)                                 */
#define MATH_EVFSR_DIVEOCS_Msk                (0x1UL)                   /*!< MATH EVFSR: DIVEOCS (Bitfield-Mask: 0x01)                   */
#define MATH_EVFSR_DIVERRS_Pos                (1UL)                     /*!< MATH EVFSR: DIVERRS (Bit 1)                                 */
#define MATH_EVFSR_DIVERRS_Msk                (0x2UL)                   /*!< MATH EVFSR: DIVERRS (Bitfield-Mask: 0x01)                   */
#define MATH_EVFSR_CDEOCS_Pos                 (2UL)                     /*!< MATH EVFSR: CDEOCS (Bit 2)                                  */
#define MATH_EVFSR_CDEOCS_Msk                 (0x4UL)                   /*!< MATH EVFSR: CDEOCS (Bitfield-Mask: 0x01)                    */
#define MATH_EVFSR_CDERRS_Pos                 (3UL)                     /*!< MATH EVFSR: CDERRS (Bit 3)                                  */
#define MATH_EVFSR_CDERRS_Msk                 (0x8UL)                   /*!< MATH EVFSR: CDERRS (Bitfield-Mask: 0x01)                    */

/* ---------------------------------  MATH_EVFCR  --------------------------------- */
#define MATH_EVFCR_DIVEOCC_Pos                (0UL)                     /*!< MATH EVFCR: DIVEOCC (Bit 0)                                 */
#define MATH_EVFCR_DIVEOCC_Msk                (0x1UL)                   /*!< MATH EVFCR: DIVEOCC (Bitfield-Mask: 0x01)                   */
#define MATH_EVFCR_DIVERRC_Pos                (1UL)                     /*!< MATH EVFCR: DIVERRC (Bit 1)                                 */
#define MATH_EVFCR_DIVERRC_Msk                (0x2UL)                   /*!< MATH EVFCR: DIVERRC (Bitfield-Mask: 0x01)                   */
#define MATH_EVFCR_CDEOCC_Pos                 (2UL)                     /*!< MATH EVFCR: CDEOCC (Bit 2)                                  */
#define MATH_EVFCR_CDEOCC_Msk                 (0x4UL)                   /*!< MATH EVFCR: CDEOCC (Bitfield-Mask: 0x01)                    */
#define MATH_EVFCR_CDERRC_Pos                 (3UL)                     /*!< MATH EVFCR: CDERRC (Bit 3)                                  */
#define MATH_EVFCR_CDERRC_Msk                 (0x8UL)                   /*!< MATH EVFCR: CDERRC (Bitfield-Mask: 0x01)                    */

/* ----------------------------------  MATH_DVD  ---------------------------------- */
#define MATH_DVD_VAL_Pos                      (0UL)                     /*!< MATH DVD: VAL (Bit 0)                                       */
#define MATH_DVD_VAL_Msk                      (0xffffffffUL)            /*!< MATH DVD: VAL (Bitfield-Mask: 0xffffffff)                   */

/* ----------------------------------  MATH_DVS  ---------------------------------- */
#define MATH_DVS_VAL_Pos                      (0UL)                     /*!< MATH DVS: VAL (Bit 0)                                       */
#define MATH_DVS_VAL_Msk                      (0xffffffffUL)            /*!< MATH DVS: VAL (Bitfield-Mask: 0xffffffff)                   */

/* ----------------------------------  MATH_QUOT  --------------------------------- */
#define MATH_QUOT_VAL_Pos                     (0UL)                     /*!< MATH QUOT: VAL (Bit 0)                                      */
#define MATH_QUOT_VAL_Msk                     (0xffffffffUL)            /*!< MATH QUOT: VAL (Bitfield-Mask: 0xffffffff)                  */

/* ----------------------------------  MATH_RMD  ---------------------------------- */
#define MATH_RMD_VAL_Pos                      (0UL)                     /*!< MATH RMD: VAL (Bit 0)                                       */
#define MATH_RMD_VAL_Msk                      (0xffffffffUL)            /*!< MATH RMD: VAL (Bitfield-Mask: 0xffffffff)                   */

/* ---------------------------------  MATH_DIVST  --------------------------------- */
#define MATH_DIVST_BSY_Pos                    (0UL)                     /*!< MATH DIVST: BSY (Bit 0)                                     */
#define MATH_DIVST_BSY_Msk                    (0x1UL)                   /*!< MATH DIVST: BSY (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  MATH_DIVCON  -------------------------------- */
#define MATH_DIVCON_ST_Pos                    (0UL)                     /*!< MATH DIVCON: ST (Bit 0)                                     */
#define MATH_DIVCON_ST_Msk                    (0x1UL)                   /*!< MATH DIVCON: ST (Bitfield-Mask: 0x01)                       */
#define MATH_DIVCON_STMODE_Pos                (1UL)                     /*!< MATH DIVCON: STMODE (Bit 1)                                 */
#define MATH_DIVCON_STMODE_Msk                (0x2UL)                   /*!< MATH DIVCON: STMODE (Bitfield-Mask: 0x01)                   */
#define MATH_DIVCON_USIGN_Pos                 (2UL)                     /*!< MATH DIVCON: USIGN (Bit 2)                                  */
#define MATH_DIVCON_USIGN_Msk                 (0x4UL)                   /*!< MATH DIVCON: USIGN (Bitfield-Mask: 0x01)                    */
#define MATH_DIVCON_DIVMODE_Pos               (3UL)                     /*!< MATH DIVCON: DIVMODE (Bit 3)                                */
#define MATH_DIVCON_DIVMODE_Msk               (0x18UL)                  /*!< MATH DIVCON: DIVMODE (Bitfield-Mask: 0x03)                  */
#define MATH_DIVCON_QSCNT_Pos                 (8UL)                     /*!< MATH DIVCON: QSCNT (Bit 8)                                  */
#define MATH_DIVCON_QSCNT_Msk                 (0x1f00UL)                /*!< MATH DIVCON: QSCNT (Bitfield-Mask: 0x1f)                    */
#define MATH_DIVCON_QSDIR_Pos                 (15UL)                    /*!< MATH DIVCON: QSDIR (Bit 15)                                 */
#define MATH_DIVCON_QSDIR_Msk                 (0x8000UL)                /*!< MATH DIVCON: QSDIR (Bitfield-Mask: 0x01)                    */
#define MATH_DIVCON_DVDSLC_Pos                (16UL)                    /*!< MATH DIVCON: DVDSLC (Bit 16)                                */
#define MATH_DIVCON_DVDSLC_Msk                (0x1f0000UL)              /*!< MATH DIVCON: DVDSLC (Bitfield-Mask: 0x1f)                   */
#define MATH_DIVCON_DVSSRC_Pos                (24UL)                    /*!< MATH DIVCON: DVSSRC (Bit 24)                                */
#define MATH_DIVCON_DVSSRC_Msk                (0x1f000000UL)            /*!< MATH DIVCON: DVSSRC (Bitfield-Mask: 0x1f)                   */

/* ---------------------------------  MATH_STATC  --------------------------------- */
#define MATH_STATC_BSY_Pos                    (0UL)                     /*!< MATH STATC: BSY (Bit 0)                                     */
#define MATH_STATC_BSY_Msk                    (0x1UL)                   /*!< MATH STATC: BSY (Bitfield-Mask: 0x01)                       */
#define MATH_STATC_KEEPX_Pos                  (5UL)                     /*!< MATH STATC: KEEPX (Bit 5)                                   */
#define MATH_STATC_KEEPX_Msk                  (0x20UL)                  /*!< MATH STATC: KEEPX (Bitfield-Mask: 0x01)                     */
#define MATH_STATC_KEEPY_Pos                  (6UL)                     /*!< MATH STATC: KEEPY (Bit 6)                                   */
#define MATH_STATC_KEEPY_Msk                  (0x40UL)                  /*!< MATH STATC: KEEPY (Bitfield-Mask: 0x01)                     */
#define MATH_STATC_KEEPZ_Pos                  (7UL)                     /*!< MATH STATC: KEEPZ (Bit 7)                                   */
#define MATH_STATC_KEEPZ_Msk                  (0x80UL)                  /*!< MATH STATC: KEEPZ (Bitfield-Mask: 0x01)                     */

/* ----------------------------------  MATH_CON  ---------------------------------- */
#define MATH_CON_ST_Pos                       (0UL)                     /*!< MATH CON: ST (Bit 0)                                        */
#define MATH_CON_ST_Msk                       (0x1UL)                   /*!< MATH CON: ST (Bitfield-Mask: 0x01)                          */
#define MATH_CON_MODE_Pos                     (1UL)                     /*!< MATH CON: MODE (Bit 1)                                      */
#define MATH_CON_MODE_Msk                     (0x6UL)                   /*!< MATH CON: MODE (Bitfield-Mask: 0x03)                        */
#define MATH_CON_ROTVEC_Pos                   (3UL)                     /*!< MATH CON: ROTVEC (Bit 3)                                    */
#define MATH_CON_ROTVEC_Msk                   (0x8UL)                   /*!< MATH CON: ROTVEC (Bitfield-Mask: 0x01)                      */
#define MATH_CON_ST_MODE_Pos                  (4UL)                     /*!< MATH CON: ST_MODE (Bit 4)                                   */
#define MATH_CON_ST_MODE_Msk                  (0x10UL)                  /*!< MATH CON: ST_MODE (Bitfield-Mask: 0x01)                     */
#define MATH_CON_X_USIGN_Pos                  (5UL)                     /*!< MATH CON: X_USIGN (Bit 5)                                   */
#define MATH_CON_X_USIGN_Msk                  (0x20UL)                  /*!< MATH CON: X_USIGN (Bitfield-Mask: 0x01)                     */
#define MATH_CON_MPS_Pos                      (6UL)                     /*!< MATH CON: MPS (Bit 6)                                       */
#define MATH_CON_MPS_Msk                      (0xc0UL)                  /*!< MATH CON: MPS (Bitfield-Mask: 0x03)                         */

