MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1402-Q064X0128/mcu.h
/* --------------------------------  LEDTS0_TSCMP1  ------------------------------- */
#define LEDTS0_TSCMP1_CMP_TS4_Pos             (0UL)                     /*!< LEDTS0 TSCMP1: CMP_TS4 (Bit 0)                              */
#define LEDTS0_TSCMP1_CMP_TS4_Msk             (0xffUL)                  /*!< LEDTS0 TSCMP1: CMP_TS4 (Bitfield-Mask: 0xff)                */
#define LEDTS0_TSCMP1_CMP_TS5_Pos             (8UL)                     /*!< LEDTS0 TSCMP1: CMP_TS5 (Bit 8)                              */
#define LEDTS0_TSCMP1_CMP_TS5_Msk             (0xff00UL)                /*!< LEDTS0 TSCMP1: CMP_TS5 (Bitfield-Mask: 0xff)                */
#define LEDTS0_TSCMP1_CMP_TS6_Pos             (16UL)                    /*!< LEDTS0 TSCMP1: CMP_TS6 (Bit 16)                             */
#define LEDTS0_TSCMP1_CMP_TS6_Msk             (0xff0000UL)              /*!< LEDTS0 TSCMP1: CMP_TS6 (Bitfield-Mask: 0xff)                */
#define LEDTS0_TSCMP1_CMP_TS7_Pos             (24UL)                    /*!< LEDTS0 TSCMP1: CMP_TS7 (Bit 24)                             */
#define LEDTS0_TSCMP1_CMP_TS7_Msk             (0xff000000UL)            /*!< LEDTS0 TSCMP1: CMP_TS7 (Bitfield-Mask: 0xff)                */


/* ================================================================================ */
/* ================         struct 'LEDTS1' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------------  LEDTS1_ID  --------------------------------- */
#define LEDTS1_ID_MOD_REV_Pos                 (0UL)                     /*!< LEDTS1 ID: MOD_REV (Bit 0)                                  */
#define LEDTS1_ID_MOD_REV_Msk                 (0xffUL)                  /*!< LEDTS1 ID: MOD_REV (Bitfield-Mask: 0xff)                    */
#define LEDTS1_ID_MOD_TYPE_Pos                (8UL)                     /*!< LEDTS1 ID: MOD_TYPE (Bit 8)                                 */
#define LEDTS1_ID_MOD_TYPE_Msk                (0xff00UL)                /*!< LEDTS1 ID: MOD_TYPE (Bitfield-Mask: 0xff)                   */
#define LEDTS1_ID_MOD_NUMBER_Pos              (16UL)                    /*!< LEDTS1 ID: MOD_NUMBER (Bit 16)                              */
#define LEDTS1_ID_MOD_NUMBER_Msk              (0xffff0000UL)            /*!< LEDTS1 ID: MOD_NUMBER (Bitfield-Mask: 0xffff)               */

/* -------------------------------  LEDTS1_GLOBCTL  ------------------------------- */
#define LEDTS1_GLOBCTL_TS_EN_Pos              (0UL)                     /*!< LEDTS1 GLOBCTL: TS_EN (Bit 0)                               */
#define LEDTS1_GLOBCTL_TS_EN_Msk              (0x1UL)                   /*!< LEDTS1 GLOBCTL: TS_EN (Bitfield-Mask: 0x01)                 */
#define LEDTS1_GLOBCTL_LD_EN_Pos              (1UL)                     /*!< LEDTS1 GLOBCTL: LD_EN (Bit 1)                               */
#define LEDTS1_GLOBCTL_LD_EN_Msk              (0x2UL)                   /*!< LEDTS1 GLOBCTL: LD_EN (Bitfield-Mask: 0x01)                 */
#define LEDTS1_GLOBCTL_CMTR_Pos               (2UL)                     /*!< LEDTS1 GLOBCTL: CMTR (Bit 2)                                */
#define LEDTS1_GLOBCTL_CMTR_Msk               (0x4UL)                   /*!< LEDTS1 GLOBCTL: CMTR (Bitfield-Mask: 0x01)                  */
#define LEDTS1_GLOBCTL_ENSYNC_Pos             (3UL)                     /*!< LEDTS1 GLOBCTL: ENSYNC (Bit 3)                              */
#define LEDTS1_GLOBCTL_ENSYNC_Msk             (0x8UL)                   /*!< LEDTS1 GLOBCTL: ENSYNC (Bitfield-Mask: 0x01)                */
#define LEDTS1_GLOBCTL_SUSCFG_Pos             (8UL)                     /*!< LEDTS1 GLOBCTL: SUSCFG (Bit 8)                              */
#define LEDTS1_GLOBCTL_SUSCFG_Msk             (0x100UL)                 /*!< LEDTS1 GLOBCTL: SUSCFG (Bitfield-Mask: 0x01)                */
#define LEDTS1_GLOBCTL_MASKVAL_Pos            (9UL)                     /*!< LEDTS1 GLOBCTL: MASKVAL (Bit 9)                             */
#define LEDTS1_GLOBCTL_MASKVAL_Msk            (0xe00UL)                 /*!< LEDTS1 GLOBCTL: MASKVAL (Bitfield-Mask: 0x07)               */
#define LEDTS1_GLOBCTL_FENVAL_Pos             (12UL)                    /*!< LEDTS1 GLOBCTL: FENVAL (Bit 12)                             */
#define LEDTS1_GLOBCTL_FENVAL_Msk             (0x1000UL)                /*!< LEDTS1 GLOBCTL: FENVAL (Bitfield-Mask: 0x01)                */
#define LEDTS1_GLOBCTL_ITS_EN_Pos             (13UL)                    /*!< LEDTS1 GLOBCTL: ITS_EN (Bit 13)                             */
#define LEDTS1_GLOBCTL_ITS_EN_Msk             (0x2000UL)                /*!< LEDTS1 GLOBCTL: ITS_EN (Bitfield-Mask: 0x01)                */
#define LEDTS1_GLOBCTL_ITF_EN_Pos             (14UL)                    /*!< LEDTS1 GLOBCTL: ITF_EN (Bit 14)                             */
#define LEDTS1_GLOBCTL_ITF_EN_Msk             (0x4000UL)                /*!< LEDTS1 GLOBCTL: ITF_EN (Bitfield-Mask: 0x01)                */
#define LEDTS1_GLOBCTL_ITP_EN_Pos             (15UL)                    /*!< LEDTS1 GLOBCTL: ITP_EN (Bit 15)                             */
#define LEDTS1_GLOBCTL_ITP_EN_Msk             (0x8000UL)                /*!< LEDTS1 GLOBCTL: ITP_EN (Bitfield-Mask: 0x01)                */
#define LEDTS1_GLOBCTL_CLK_PS_Pos             (16UL)                    /*!< LEDTS1 GLOBCTL: CLK_PS (Bit 16)                             */
#define LEDTS1_GLOBCTL_CLK_PS_Msk             (0xffff0000UL)            /*!< LEDTS1 GLOBCTL: CLK_PS (Bitfield-Mask: 0xffff)              */

/* --------------------------------  LEDTS1_FNCTL  -------------------------------- */
#define LEDTS1_FNCTL_PADT_Pos                 (0UL)                     /*!< LEDTS1 FNCTL: PADT (Bit 0)                                  */
#define LEDTS1_FNCTL_PADT_Msk                 (0x7UL)                   /*!< LEDTS1 FNCTL: PADT (Bitfield-Mask: 0x07)                    */
#define LEDTS1_FNCTL_PADTSW_Pos               (3UL)                     /*!< LEDTS1 FNCTL: PADTSW (Bit 3)                                */
#define LEDTS1_FNCTL_PADTSW_Msk               (0x8UL)                   /*!< LEDTS1 FNCTL: PADTSW (Bitfield-Mask: 0x01)                  */
#define LEDTS1_FNCTL_EPULL_Pos                (4UL)                     /*!< LEDTS1 FNCTL: EPULL (Bit 4)                                 */
#define LEDTS1_FNCTL_EPULL_Msk                (0x10UL)                  /*!< LEDTS1 FNCTL: EPULL (Bitfield-Mask: 0x01)                   */
#define LEDTS1_FNCTL_FNCOL_Pos                (5UL)                     /*!< LEDTS1 FNCTL: FNCOL (Bit 5)                                 */
#define LEDTS1_FNCTL_FNCOL_Msk                (0xe0UL)                  /*!< LEDTS1 FNCTL: FNCOL (Bitfield-Mask: 0x07)                   */
#define LEDTS1_FNCTL_ACCCNT_Pos               (16UL)                    /*!< LEDTS1 FNCTL: ACCCNT (Bit 16)                               */
#define LEDTS1_FNCTL_ACCCNT_Msk               (0xf0000UL)               /*!< LEDTS1 FNCTL: ACCCNT (Bitfield-Mask: 0x0f)                  */
#define LEDTS1_FNCTL_TSCCMP_Pos               (20UL)                    /*!< LEDTS1 FNCTL: TSCCMP (Bit 20)                               */
#define LEDTS1_FNCTL_TSCCMP_Msk               (0x100000UL)              /*!< LEDTS1 FNCTL: TSCCMP (Bitfield-Mask: 0x01)                  */
#define LEDTS1_FNCTL_TSOEXT_Pos               (21UL)                    /*!< LEDTS1 FNCTL: TSOEXT (Bit 21)                               */
#define LEDTS1_FNCTL_TSOEXT_Msk               (0x600000UL)              /*!< LEDTS1 FNCTL: TSOEXT (Bitfield-Mask: 0x03)                  */
#define LEDTS1_FNCTL_TSCTRR_Pos               (23UL)                    /*!< LEDTS1 FNCTL: TSCTRR (Bit 23)                               */
#define LEDTS1_FNCTL_TSCTRR_Msk               (0x800000UL)              /*!< LEDTS1 FNCTL: TSCTRR (Bitfield-Mask: 0x01)                  */
#define LEDTS1_FNCTL_TSCTRSAT_Pos             (24UL)                    /*!< LEDTS1 FNCTL: TSCTRSAT (Bit 24)                             */
#define LEDTS1_FNCTL_TSCTRSAT_Msk             (0x1000000UL)             /*!< LEDTS1 FNCTL: TSCTRSAT (Bitfield-Mask: 0x01)                */
#define LEDTS1_FNCTL_NR_TSIN_Pos              (25UL)                    /*!< LEDTS1 FNCTL: NR_TSIN (Bit 25)                              */
#define LEDTS1_FNCTL_NR_TSIN_Msk              (0xe000000UL)             /*!< LEDTS1 FNCTL: NR_TSIN (Bitfield-Mask: 0x07)                 */
#define LEDTS1_FNCTL_COLLEV_Pos               (28UL)                    /*!< LEDTS1 FNCTL: COLLEV (Bit 28)                               */
#define LEDTS1_FNCTL_COLLEV_Msk               (0x10000000UL)            /*!< LEDTS1 FNCTL: COLLEV (Bitfield-Mask: 0x01)                  */
#define LEDTS1_FNCTL_NR_LEDCOL_Pos            (29UL)                    /*!< LEDTS1 FNCTL: NR_LEDCOL (Bit 29)                            */
#define LEDTS1_FNCTL_NR_LEDCOL_Msk            (0xe0000000UL)            /*!< LEDTS1 FNCTL: NR_LEDCOL (Bitfield-Mask: 0x07)               */

/* ---------------------------------  LEDTS1_EVFR  -------------------------------- */
#define LEDTS1_EVFR_TSF_Pos                   (0UL)                     /*!< LEDTS1 EVFR: TSF (Bit 0)                                    */
#define LEDTS1_EVFR_TSF_Msk                   (0x1UL)                   /*!< LEDTS1 EVFR: TSF (Bitfield-Mask: 0x01)                      */
#define LEDTS1_EVFR_TFF_Pos                   (1UL)                     /*!< LEDTS1 EVFR: TFF (Bit 1)                                    */
#define LEDTS1_EVFR_TFF_Msk                   (0x2UL)                   /*!< LEDTS1 EVFR: TFF (Bitfield-Mask: 0x01)                      */
#define LEDTS1_EVFR_TPF_Pos                   (2UL)                     /*!< LEDTS1 EVFR: TPF (Bit 2)                                    */
#define LEDTS1_EVFR_TPF_Msk                   (0x4UL)                   /*!< LEDTS1 EVFR: TPF (Bitfield-Mask: 0x01)                      */
#define LEDTS1_EVFR_TSCTROVF_Pos              (3UL)                     /*!< LEDTS1 EVFR: TSCTROVF (Bit 3)                               */
#define LEDTS1_EVFR_TSCTROVF_Msk              (0x8UL)                   /*!< LEDTS1 EVFR: TSCTROVF (Bitfield-Mask: 0x01)                 */
#define LEDTS1_EVFR_CTSF_Pos                  (16UL)                    /*!< LEDTS1 EVFR: CTSF (Bit 16)                                  */
#define LEDTS1_EVFR_CTSF_Msk                  (0x10000UL)               /*!< LEDTS1 EVFR: CTSF (Bitfield-Mask: 0x01)                     */
#define LEDTS1_EVFR_CTFF_Pos                  (17UL)                    /*!< LEDTS1 EVFR: CTFF (Bit 17)                                  */
#define LEDTS1_EVFR_CTFF_Msk                  (0x20000UL)               /*!< LEDTS1 EVFR: CTFF (Bitfield-Mask: 0x01)                     */
#define LEDTS1_EVFR_CTPF_Pos                  (18UL)                    /*!< LEDTS1 EVFR: CTPF (Bit 18)                                  */
#define LEDTS1_EVFR_CTPF_Msk                  (0x40000UL)               /*!< LEDTS1 EVFR: CTPF (Bitfield-Mask: 0x01)                     */

/* --------------------------------  LEDTS1_TSVAL  -------------------------------- */
#define LEDTS1_TSVAL_TSCTRVALR_Pos            (0UL)                     /*!< LEDTS1 TSVAL: TSCTRVALR (Bit 0)                             */
#define LEDTS1_TSVAL_TSCTRVALR_Msk            (0xffffUL)                /*!< LEDTS1 TSVAL: TSCTRVALR (Bitfield-Mask: 0xffff)             */
#define LEDTS1_TSVAL_TSCTRVAL_Pos             (16UL)                    /*!< LEDTS1 TSVAL: TSCTRVAL (Bit 16)                             */
#define LEDTS1_TSVAL_TSCTRVAL_Msk             (0xffff0000UL)            /*!< LEDTS1 TSVAL: TSCTRVAL (Bitfield-Mask: 0xffff)              */

/* --------------------------------  LEDTS1_LINE0  -------------------------------- */
#define LEDTS1_LINE0_LINE_0_Pos               (0UL)                     /*!< LEDTS1 LINE0: LINE_0 (Bit 0)                                */
#define LEDTS1_LINE0_LINE_0_Msk               (0xffUL)                  /*!< LEDTS1 LINE0: LINE_0 (Bitfield-Mask: 0xff)                  */
#define LEDTS1_LINE0_LINE_1_Pos               (8UL)                     /*!< LEDTS1 LINE0: LINE_1 (Bit 8)                                */
#define LEDTS1_LINE0_LINE_1_Msk               (0xff00UL)                /*!< LEDTS1 LINE0: LINE_1 (Bitfield-Mask: 0xff)                  */
#define LEDTS1_LINE0_LINE_2_Pos               (16UL)                    /*!< LEDTS1 LINE0: LINE_2 (Bit 16)                               */
#define LEDTS1_LINE0_LINE_2_Msk               (0xff0000UL)              /*!< LEDTS1 LINE0: LINE_2 (Bitfield-Mask: 0xff)                  */
#define LEDTS1_LINE0_LINE_3_Pos               (24UL)                    /*!< LEDTS1 LINE0: LINE_3 (Bit 24)                               */
#define LEDTS1_LINE0_LINE_3_Msk               (0xff000000UL)            /*!< LEDTS1 LINE0: LINE_3 (Bitfield-Mask: 0xff)                  */

/* --------------------------------  LEDTS1_LINE1  -------------------------------- */
#define LEDTS1_LINE1_LINE_4_Pos               (0UL)                     /*!< LEDTS1 LINE1: LINE_4 (Bit 0)                                */
#define LEDTS1_LINE1_LINE_4_Msk               (0xffUL)                  /*!< LEDTS1 LINE1: LINE_4 (Bitfield-Mask: 0xff)                  */
#define LEDTS1_LINE1_LINE_5_Pos               (8UL)                     /*!< LEDTS1 LINE1: LINE_5 (Bit 8)                                */
#define LEDTS1_LINE1_LINE_5_Msk               (0xff00UL)                /*!< LEDTS1 LINE1: LINE_5 (Bitfield-Mask: 0xff)                  */
#define LEDTS1_LINE1_LINE_6_Pos               (16UL)                    /*!< LEDTS1 LINE1: LINE_6 (Bit 16)                               */
#define LEDTS1_LINE1_LINE_6_Msk               (0xff0000UL)              /*!< LEDTS1 LINE1: LINE_6 (Bitfield-Mask: 0xff)                  */
#define LEDTS1_LINE1_LINE_A_Pos               (24UL)                    /*!< LEDTS1 LINE1: LINE_A (Bit 24)                               */
#define LEDTS1_LINE1_LINE_A_Msk               (0xff000000UL)            /*!< LEDTS1 LINE1: LINE_A (Bitfield-Mask: 0xff)                  */

