MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1402-Q064X0128/mcu.h
/* ----------------------------  SCU_GENERAL_DBGROMID  ---------------------------- */
#define SCU_GENERAL_DBGROMID_MANUFID_Pos      (1UL)                     /*!< SCU_GENERAL DBGROMID: MANUFID (Bit 1)                       */
#define SCU_GENERAL_DBGROMID_MANUFID_Msk      (0xffeUL)                 /*!< SCU_GENERAL DBGROMID: MANUFID (Bitfield-Mask: 0x7ff)        */
#define SCU_GENERAL_DBGROMID_PARTNO_Pos       (12UL)                    /*!< SCU_GENERAL DBGROMID: PARTNO (Bit 12)                       */
#define SCU_GENERAL_DBGROMID_PARTNO_Msk       (0xffff000UL)             /*!< SCU_GENERAL DBGROMID: PARTNO (Bitfield-Mask: 0xffff)        */
#define SCU_GENERAL_DBGROMID_VERSION_Pos      (28UL)                    /*!< SCU_GENERAL DBGROMID: VERSION (Bit 28)                      */
#define SCU_GENERAL_DBGROMID_VERSION_Msk      (0xf0000000UL)            /*!< SCU_GENERAL DBGROMID: VERSION (Bitfield-Mask: 0x0f)         */

/* -----------------------------  SCU_GENERAL_IDCHIP  ----------------------------- */
#define SCU_GENERAL_IDCHIP_IDCHIP_Pos         (0UL)                     /*!< SCU_GENERAL IDCHIP: IDCHIP (Bit 0)                          */
#define SCU_GENERAL_IDCHIP_IDCHIP_Msk         (0xffffffffUL)            /*!< SCU_GENERAL IDCHIP: IDCHIP (Bitfield-Mask: 0xffffffff)      */

/* -------------------------------  SCU_GENERAL_ID  ------------------------------- */
#define SCU_GENERAL_ID_MOD_REV_Pos            (0UL)                     /*!< SCU_GENERAL ID: MOD_REV (Bit 0)                             */
#define SCU_GENERAL_ID_MOD_REV_Msk            (0xffUL)                  /*!< SCU_GENERAL ID: MOD_REV (Bitfield-Mask: 0xff)               */
#define SCU_GENERAL_ID_MOD_TYPE_Pos           (8UL)                     /*!< SCU_GENERAL ID: MOD_TYPE (Bit 8)                            */
#define SCU_GENERAL_ID_MOD_TYPE_Msk           (0xff00UL)                /*!< SCU_GENERAL ID: MOD_TYPE (Bitfield-Mask: 0xff)              */
#define SCU_GENERAL_ID_MOD_NUMBER_Pos         (16UL)                    /*!< SCU_GENERAL ID: MOD_NUMBER (Bit 16)                         */
#define SCU_GENERAL_ID_MOD_NUMBER_Msk         (0xffff0000UL)            /*!< SCU_GENERAL ID: MOD_NUMBER (Bitfield-Mask: 0xffff)          */

/* ------------------------------  SCU_GENERAL_SSW0  ------------------------------ */
#define SCU_GENERAL_SSW0_DAT_Pos              (0UL)                     /*!< SCU_GENERAL SSW0: DAT (Bit 0)                               */
#define SCU_GENERAL_SSW0_DAT_Msk              (0xffffffffUL)            /*!< SCU_GENERAL SSW0: DAT (Bitfield-Mask: 0xffffffff)           */

/* -----------------------------  SCU_GENERAL_PASSWD  ----------------------------- */
#define SCU_GENERAL_PASSWD_MODE_Pos           (0UL)                     /*!< SCU_GENERAL PASSWD: MODE (Bit 0)                            */
#define SCU_GENERAL_PASSWD_MODE_Msk           (0x3UL)                   /*!< SCU_GENERAL PASSWD: MODE (Bitfield-Mask: 0x03)              */
#define SCU_GENERAL_PASSWD_PROTS_Pos          (2UL)                     /*!< SCU_GENERAL PASSWD: PROTS (Bit 2)                           */
#define SCU_GENERAL_PASSWD_PROTS_Msk          (0x4UL)                   /*!< SCU_GENERAL PASSWD: PROTS (Bitfield-Mask: 0x01)             */
#define SCU_GENERAL_PASSWD_PASS_Pos           (3UL)                     /*!< SCU_GENERAL PASSWD: PASS (Bit 3)                            */
#define SCU_GENERAL_PASSWD_PASS_Msk           (0xf8UL)                  /*!< SCU_GENERAL PASSWD: PASS (Bitfield-Mask: 0x1f)              */

/* -----------------------------  SCU_GENERAL_CCUCON  ----------------------------- */
#define SCU_GENERAL_CCUCON_GSC40_Pos          (0UL)                     /*!< SCU_GENERAL CCUCON: GSC40 (Bit 0)                           */
#define SCU_GENERAL_CCUCON_GSC40_Msk          (0x1UL)                   /*!< SCU_GENERAL CCUCON: GSC40 (Bitfield-Mask: 0x01)             */
#define SCU_GENERAL_CCUCON_GSC41_Pos          (1UL)                     /*!< SCU_GENERAL CCUCON: GSC41 (Bit 1)                           */
#define SCU_GENERAL_CCUCON_GSC41_Msk          (0x2UL)                   /*!< SCU_GENERAL CCUCON: GSC41 (Bitfield-Mask: 0x01)             */
#define SCU_GENERAL_CCUCON_GSC80_Pos          (8UL)                     /*!< SCU_GENERAL CCUCON: GSC80 (Bit 8)                           */
#define SCU_GENERAL_CCUCON_GSC80_Msk          (0x100UL)                 /*!< SCU_GENERAL CCUCON: GSC80 (Bitfield-Mask: 0x01)             */
#define SCU_GENERAL_CCUCON_GSC81_Pos          (9UL)                     /*!< SCU_GENERAL CCUCON: GSC81 (Bit 9)                           */
#define SCU_GENERAL_CCUCON_GSC81_Msk          (0x200UL)                 /*!< SCU_GENERAL CCUCON: GSC81 (Bitfield-Mask: 0x01)             */

/* -----------------------------  SCU_GENERAL_MIRRSTS  ---------------------------- */
#define SCU_GENERAL_MIRRSTS_RTC_CTR_Pos       (0UL)                     /*!< SCU_GENERAL MIRRSTS: RTC_CTR (Bit 0)                        */
#define SCU_GENERAL_MIRRSTS_RTC_CTR_Msk       (0x1UL)                   /*!< SCU_GENERAL MIRRSTS: RTC_CTR (Bitfield-Mask: 0x01)          */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM0_Pos     (1UL)                     /*!< SCU_GENERAL MIRRSTS: RTC_ATIM0 (Bit 1)                      */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM0_Msk     (0x2UL)                   /*!< SCU_GENERAL MIRRSTS: RTC_ATIM0 (Bitfield-Mask: 0x01)        */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM1_Pos     (2UL)                     /*!< SCU_GENERAL MIRRSTS: RTC_ATIM1 (Bit 2)                      */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM1_Msk     (0x4UL)                   /*!< SCU_GENERAL MIRRSTS: RTC_ATIM1 (Bitfield-Mask: 0x01)        */
#define SCU_GENERAL_MIRRSTS_RTC_TIM0_Pos      (3UL)                     /*!< SCU_GENERAL MIRRSTS: RTC_TIM0 (Bit 3)                       */
#define SCU_GENERAL_MIRRSTS_RTC_TIM0_Msk      (0x8UL)                   /*!< SCU_GENERAL MIRRSTS: RTC_TIM0 (Bitfield-Mask: 0x01)         */
#define SCU_GENERAL_MIRRSTS_RTC_TIM1_Pos      (4UL)                     /*!< SCU_GENERAL MIRRSTS: RTC_TIM1 (Bit 4)                       */
#define SCU_GENERAL_MIRRSTS_RTC_TIM1_Msk      (0x10UL)                  /*!< SCU_GENERAL MIRRSTS: RTC_TIM1 (Bitfield-Mask: 0x01)         */

/* ------------------------------  SCU_GENERAL_PMTSR  ----------------------------- */
#define SCU_GENERAL_PMTSR_MTENS_Pos           (0UL)                     /*!< SCU_GENERAL PMTSR: MTENS (Bit 0)                            */
#define SCU_GENERAL_PMTSR_MTENS_Msk           (0x1UL)                   /*!< SCU_GENERAL PMTSR: MTENS (Bitfield-Mask: 0x01)              */

/* ------------------------------  SCU_GENERAL_PFUCR  ----------------------------- */
#define SCU_GENERAL_PFUCR_PFUBYP_Pos          (0UL)                     /*!< SCU_GENERAL PFUCR: PFUBYP (Bit 0)                           */
#define SCU_GENERAL_PFUCR_PFUBYP_Msk          (0x1UL)                   /*!< SCU_GENERAL PFUCR: PFUBYP (Bitfield-Mask: 0x01)             */

/* -----------------------------  SCU_GENERAL_INTCR0  ----------------------------- */
#define SCU_GENERAL_INTCR0_INTSEL0_Pos        (0UL)                     /*!< SCU_GENERAL INTCR0: INTSEL0 (Bit 0)                         */
#define SCU_GENERAL_INTCR0_INTSEL0_Msk        (0x3UL)                   /*!< SCU_GENERAL INTCR0: INTSEL0 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL1_Pos        (2UL)                     /*!< SCU_GENERAL INTCR0: INTSEL1 (Bit 2)                         */
#define SCU_GENERAL_INTCR0_INTSEL1_Msk        (0xcUL)                   /*!< SCU_GENERAL INTCR0: INTSEL1 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL2_Pos        (4UL)                     /*!< SCU_GENERAL INTCR0: INTSEL2 (Bit 4)                         */
#define SCU_GENERAL_INTCR0_INTSEL2_Msk        (0x30UL)                  /*!< SCU_GENERAL INTCR0: INTSEL2 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL3_Pos        (6UL)                     /*!< SCU_GENERAL INTCR0: INTSEL3 (Bit 6)                         */
#define SCU_GENERAL_INTCR0_INTSEL3_Msk        (0xc0UL)                  /*!< SCU_GENERAL INTCR0: INTSEL3 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL4_Pos        (8UL)                     /*!< SCU_GENERAL INTCR0: INTSEL4 (Bit 8)                         */
#define SCU_GENERAL_INTCR0_INTSEL4_Msk        (0x300UL)                 /*!< SCU_GENERAL INTCR0: INTSEL4 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL5_Pos        (10UL)                    /*!< SCU_GENERAL INTCR0: INTSEL5 (Bit 10)                        */
#define SCU_GENERAL_INTCR0_INTSEL5_Msk        (0xc00UL)                 /*!< SCU_GENERAL INTCR0: INTSEL5 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL6_Pos        (12UL)                    /*!< SCU_GENERAL INTCR0: INTSEL6 (Bit 12)                        */
#define SCU_GENERAL_INTCR0_INTSEL6_Msk        (0x3000UL)                /*!< SCU_GENERAL INTCR0: INTSEL6 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL7_Pos        (14UL)                    /*!< SCU_GENERAL INTCR0: INTSEL7 (Bit 14)                        */
#define SCU_GENERAL_INTCR0_INTSEL7_Msk        (0xc000UL)                /*!< SCU_GENERAL INTCR0: INTSEL7 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL8_Pos        (16UL)                    /*!< SCU_GENERAL INTCR0: INTSEL8 (Bit 16)                        */
#define SCU_GENERAL_INTCR0_INTSEL8_Msk        (0x30000UL)               /*!< SCU_GENERAL INTCR0: INTSEL8 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL9_Pos        (18UL)                    /*!< SCU_GENERAL INTCR0: INTSEL9 (Bit 18)                        */
#define SCU_GENERAL_INTCR0_INTSEL9_Msk        (0xc0000UL)               /*!< SCU_GENERAL INTCR0: INTSEL9 (Bitfield-Mask: 0x03)           */
#define SCU_GENERAL_INTCR0_INTSEL10_Pos       (20UL)                    /*!< SCU_GENERAL INTCR0: INTSEL10 (Bit 20)                       */
#define SCU_GENERAL_INTCR0_INTSEL10_Msk       (0x300000UL)              /*!< SCU_GENERAL INTCR0: INTSEL10 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR0_INTSEL11_Pos       (22UL)                    /*!< SCU_GENERAL INTCR0: INTSEL11 (Bit 22)                       */
#define SCU_GENERAL_INTCR0_INTSEL11_Msk       (0xc00000UL)              /*!< SCU_GENERAL INTCR0: INTSEL11 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR0_INTSEL12_Pos       (24UL)                    /*!< SCU_GENERAL INTCR0: INTSEL12 (Bit 24)                       */
#define SCU_GENERAL_INTCR0_INTSEL12_Msk       (0x3000000UL)             /*!< SCU_GENERAL INTCR0: INTSEL12 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR0_INTSEL13_Pos       (26UL)                    /*!< SCU_GENERAL INTCR0: INTSEL13 (Bit 26)                       */
#define SCU_GENERAL_INTCR0_INTSEL13_Msk       (0xc000000UL)             /*!< SCU_GENERAL INTCR0: INTSEL13 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR0_INTSEL14_Pos       (28UL)                    /*!< SCU_GENERAL INTCR0: INTSEL14 (Bit 28)                       */
#define SCU_GENERAL_INTCR0_INTSEL14_Msk       (0x30000000UL)            /*!< SCU_GENERAL INTCR0: INTSEL14 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR0_INTSEL15_Pos       (30UL)                    /*!< SCU_GENERAL INTCR0: INTSEL15 (Bit 30)                       */
#define SCU_GENERAL_INTCR0_INTSEL15_Msk       (0xc0000000UL)            /*!< SCU_GENERAL INTCR0: INTSEL15 (Bitfield-Mask: 0x03)          */

/* -----------------------------  SCU_GENERAL_INTCR1  ----------------------------- */
#define SCU_GENERAL_INTCR1_INTSEL16_Pos       (0UL)                     /*!< SCU_GENERAL INTCR1: INTSEL16 (Bit 0)                        */
#define SCU_GENERAL_INTCR1_INTSEL16_Msk       (0x3UL)                   /*!< SCU_GENERAL INTCR1: INTSEL16 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL17_Pos       (2UL)                     /*!< SCU_GENERAL INTCR1: INTSEL17 (Bit 2)                        */
#define SCU_GENERAL_INTCR1_INTSEL17_Msk       (0xcUL)                   /*!< SCU_GENERAL INTCR1: INTSEL17 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL18_Pos       (4UL)                     /*!< SCU_GENERAL INTCR1: INTSEL18 (Bit 4)                        */
#define SCU_GENERAL_INTCR1_INTSEL18_Msk       (0x30UL)                  /*!< SCU_GENERAL INTCR1: INTSEL18 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL19_Pos       (6UL)                     /*!< SCU_GENERAL INTCR1: INTSEL19 (Bit 6)                        */
#define SCU_GENERAL_INTCR1_INTSEL19_Msk       (0xc0UL)                  /*!< SCU_GENERAL INTCR1: INTSEL19 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL20_Pos       (8UL)                     /*!< SCU_GENERAL INTCR1: INTSEL20 (Bit 8)                        */
#define SCU_GENERAL_INTCR1_INTSEL20_Msk       (0x300UL)                 /*!< SCU_GENERAL INTCR1: INTSEL20 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL21_Pos       (10UL)                    /*!< SCU_GENERAL INTCR1: INTSEL21 (Bit 10)                       */
#define SCU_GENERAL_INTCR1_INTSEL21_Msk       (0xc00UL)                 /*!< SCU_GENERAL INTCR1: INTSEL21 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL22_Pos       (12UL)                    /*!< SCU_GENERAL INTCR1: INTSEL22 (Bit 12)                       */
#define SCU_GENERAL_INTCR1_INTSEL22_Msk       (0x3000UL)                /*!< SCU_GENERAL INTCR1: INTSEL22 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL23_Pos       (14UL)                    /*!< SCU_GENERAL INTCR1: INTSEL23 (Bit 14)                       */
#define SCU_GENERAL_INTCR1_INTSEL23_Msk       (0xc000UL)                /*!< SCU_GENERAL INTCR1: INTSEL23 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL24_Pos       (16UL)                    /*!< SCU_GENERAL INTCR1: INTSEL24 (Bit 16)                       */
#define SCU_GENERAL_INTCR1_INTSEL24_Msk       (0x30000UL)               /*!< SCU_GENERAL INTCR1: INTSEL24 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL25_Pos       (18UL)                    /*!< SCU_GENERAL INTCR1: INTSEL25 (Bit 18)                       */
#define SCU_GENERAL_INTCR1_INTSEL25_Msk       (0xc0000UL)               /*!< SCU_GENERAL INTCR1: INTSEL25 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL26_Pos       (20UL)                    /*!< SCU_GENERAL INTCR1: INTSEL26 (Bit 20)                       */
#define SCU_GENERAL_INTCR1_INTSEL26_Msk       (0x300000UL)              /*!< SCU_GENERAL INTCR1: INTSEL26 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL27_Pos       (22UL)                    /*!< SCU_GENERAL INTCR1: INTSEL27 (Bit 22)                       */
#define SCU_GENERAL_INTCR1_INTSEL27_Msk       (0xc00000UL)              /*!< SCU_GENERAL INTCR1: INTSEL27 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL28_Pos       (24UL)                    /*!< SCU_GENERAL INTCR1: INTSEL28 (Bit 24)                       */
#define SCU_GENERAL_INTCR1_INTSEL28_Msk       (0x3000000UL)             /*!< SCU_GENERAL INTCR1: INTSEL28 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL29_Pos       (26UL)                    /*!< SCU_GENERAL INTCR1: INTSEL29 (Bit 26)                       */
#define SCU_GENERAL_INTCR1_INTSEL29_Msk       (0xc000000UL)             /*!< SCU_GENERAL INTCR1: INTSEL29 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL30_Pos       (28UL)                    /*!< SCU_GENERAL INTCR1: INTSEL30 (Bit 28)                       */
#define SCU_GENERAL_INTCR1_INTSEL30_Msk       (0x30000000UL)            /*!< SCU_GENERAL INTCR1: INTSEL30 (Bitfield-Mask: 0x03)          */
#define SCU_GENERAL_INTCR1_INTSEL31_Pos       (30UL)                    /*!< SCU_GENERAL INTCR1: INTSEL31 (Bit 30)                       */
#define SCU_GENERAL_INTCR1_INTSEL31_Msk       (0xc0000000UL)            /*!< SCU_GENERAL INTCR1: INTSEL31 (Bitfield-Mask: 0x03)          */

/* -----------------------------  SCU_GENERAL_STSTAT  ----------------------------- */
#define SCU_GENERAL_STSTAT_HWCON_Pos          (0UL)                     /*!< SCU_GENERAL STSTAT: HWCON (Bit 0)                           */
#define SCU_GENERAL_STSTAT_HWCON_Msk          (0x3UL)                   /*!< SCU_GENERAL STSTAT: HWCON (Bitfield-Mask: 0x03)             */


/* ================================================================================ */
/* ================     struct 'SCU_INTERRUPT' Position & Mask     ================ */
/* ================================================================================ */


