MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1402-Q064X0128/mcu.h
/* ----------------------------------  PORT3_OMR  --------------------------------- */
#define PORT3_OMR_PS0_Pos                     (0UL)                     /*!< PORT3 OMR: PS0 (Bit 0)                                      */
#define PORT3_OMR_PS0_Msk                     (0x1UL)                   /*!< PORT3 OMR: PS0 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS1_Pos                     (1UL)                     /*!< PORT3 OMR: PS1 (Bit 1)                                      */
#define PORT3_OMR_PS1_Msk                     (0x2UL)                   /*!< PORT3 OMR: PS1 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS2_Pos                     (2UL)                     /*!< PORT3 OMR: PS2 (Bit 2)                                      */
#define PORT3_OMR_PS2_Msk                     (0x4UL)                   /*!< PORT3 OMR: PS2 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS3_Pos                     (3UL)                     /*!< PORT3 OMR: PS3 (Bit 3)                                      */
#define PORT3_OMR_PS3_Msk                     (0x8UL)                   /*!< PORT3 OMR: PS3 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS4_Pos                     (4UL)                     /*!< PORT3 OMR: PS4 (Bit 4)                                      */
#define PORT3_OMR_PS4_Msk                     (0x10UL)                  /*!< PORT3 OMR: PS4 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR0_Pos                     (16UL)                    /*!< PORT3 OMR: PR0 (Bit 16)                                     */
#define PORT3_OMR_PR0_Msk                     (0x10000UL)               /*!< PORT3 OMR: PR0 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR1_Pos                     (17UL)                    /*!< PORT3 OMR: PR1 (Bit 17)                                     */
#define PORT3_OMR_PR1_Msk                     (0x20000UL)               /*!< PORT3 OMR: PR1 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR2_Pos                     (18UL)                    /*!< PORT3 OMR: PR2 (Bit 18)                                     */
#define PORT3_OMR_PR2_Msk                     (0x40000UL)               /*!< PORT3 OMR: PR2 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR3_Pos                     (19UL)                    /*!< PORT3 OMR: PR3 (Bit 19)                                     */
#define PORT3_OMR_PR3_Msk                     (0x80000UL)               /*!< PORT3 OMR: PR3 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR4_Pos                     (20UL)                    /*!< PORT3 OMR: PR4 (Bit 20)                                     */
#define PORT3_OMR_PR4_Msk                     (0x100000UL)              /*!< PORT3 OMR: PR4 (Bitfield-Mask: 0x01)                        */

/* ---------------------------------  PORT3_IOCR0  -------------------------------- */
#define PORT3_IOCR0_PC0_Pos                   (2UL)                     /*!< PORT3 IOCR0: PC0 (Bit 2)                                    */
#define PORT3_IOCR0_PC0_Msk                   (0xfcUL)                  /*!< PORT3 IOCR0: PC0 (Bitfield-Mask: 0x3f)                      */
#define PORT3_IOCR0_PC1_Pos                   (10UL)                    /*!< PORT3 IOCR0: PC1 (Bit 10)                                   */
#define PORT3_IOCR0_PC1_Msk                   (0xfc00UL)                /*!< PORT3 IOCR0: PC1 (Bitfield-Mask: 0x3f)                      */
#define PORT3_IOCR0_PC2_Pos                   (18UL)                    /*!< PORT3 IOCR0: PC2 (Bit 18)                                   */
#define PORT3_IOCR0_PC2_Msk                   (0xfc0000UL)              /*!< PORT3 IOCR0: PC2 (Bitfield-Mask: 0x3f)                      */
#define PORT3_IOCR0_PC3_Pos                   (26UL)                    /*!< PORT3 IOCR0: PC3 (Bit 26)                                   */
#define PORT3_IOCR0_PC3_Msk                   (0xfc000000UL)            /*!< PORT3 IOCR0: PC3 (Bitfield-Mask: 0x3f)                      */

/* ---------------------------------  PORT3_IOCR4  -------------------------------- */
#define PORT3_IOCR4_PC4_Pos                   (2UL)                     /*!< PORT3 IOCR4: PC4 (Bit 2)                                    */
#define PORT3_IOCR4_PC4_Msk                   (0xfcUL)                  /*!< PORT3 IOCR4: PC4 (Bitfield-Mask: 0x3f)                      */

/* ----------------------------------  PORT3_IN  ---------------------------------- */
#define PORT3_IN_P0_Pos                       (0UL)                     /*!< PORT3 IN: P0 (Bit 0)                                        */
#define PORT3_IN_P0_Msk                       (0x1UL)                   /*!< PORT3 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P1_Pos                       (1UL)                     /*!< PORT3 IN: P1 (Bit 1)                                        */
#define PORT3_IN_P1_Msk                       (0x2UL)                   /*!< PORT3 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P2_Pos                       (2UL)                     /*!< PORT3 IN: P2 (Bit 2)                                        */
#define PORT3_IN_P2_Msk                       (0x4UL)                   /*!< PORT3 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P3_Pos                       (3UL)                     /*!< PORT3 IN: P3 (Bit 3)                                        */
#define PORT3_IN_P3_Msk                       (0x8UL)                   /*!< PORT3 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P4_Pos                       (4UL)                     /*!< PORT3 IN: P4 (Bit 4)                                        */
#define PORT3_IN_P4_Msk                       (0x10UL)                  /*!< PORT3 IN: P4 (Bitfield-Mask: 0x01)                          */

/* ---------------------------------  PORT3_PHCR0  -------------------------------- */
#define PORT3_PHCR0_PH0_Pos                   (2UL)                     /*!< PORT3 PHCR0: PH0 (Bit 2)                                    */
#define PORT3_PHCR0_PH0_Msk                   (0x4UL)                   /*!< PORT3 PHCR0: PH0 (Bitfield-Mask: 0x01)                      */
#define PORT3_PHCR0_PH1_Pos                   (6UL)                     /*!< PORT3 PHCR0: PH1 (Bit 6)                                    */
#define PORT3_PHCR0_PH1_Msk                   (0x40UL)                  /*!< PORT3 PHCR0: PH1 (Bitfield-Mask: 0x01)                      */
#define PORT3_PHCR0_PH2_Pos                   (10UL)                    /*!< PORT3 PHCR0: PH2 (Bit 10)                                   */
#define PORT3_PHCR0_PH2_Msk                   (0x400UL)                 /*!< PORT3 PHCR0: PH2 (Bitfield-Mask: 0x01)                      */
#define PORT3_PHCR0_PH3_Pos                   (14UL)                    /*!< PORT3 PHCR0: PH3 (Bit 14)                                   */
#define PORT3_PHCR0_PH3_Msk                   (0x4000UL)                /*!< PORT3 PHCR0: PH3 (Bitfield-Mask: 0x01)                      */
#define PORT3_PHCR0_PH4_Pos                   (18UL)                    /*!< PORT3 PHCR0: PH4 (Bit 18)                                   */
#define PORT3_PHCR0_PH4_Msk                   (0x40000UL)               /*!< PORT3 PHCR0: PH4 (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  PORT3_PDISC  -------------------------------- */
#define PORT3_PDISC_PDIS0_Pos                 (0UL)                     /*!< PORT3 PDISC: PDIS0 (Bit 0)                                  */
#define PORT3_PDISC_PDIS0_Msk                 (0x1UL)                   /*!< PORT3 PDISC: PDIS0 (Bitfield-Mask: 0x01)                    */
#define PORT3_PDISC_PDIS1_Pos                 (1UL)                     /*!< PORT3 PDISC: PDIS1 (Bit 1)                                  */
#define PORT3_PDISC_PDIS1_Msk                 (0x2UL)                   /*!< PORT3 PDISC: PDIS1 (Bitfield-Mask: 0x01)                    */
#define PORT3_PDISC_PDIS2_Pos                 (2UL)                     /*!< PORT3 PDISC: PDIS2 (Bit 2)                                  */
#define PORT3_PDISC_PDIS2_Msk                 (0x4UL)                   /*!< PORT3 PDISC: PDIS2 (Bitfield-Mask: 0x01)                    */
#define PORT3_PDISC_PDIS3_Pos                 (3UL)                     /*!< PORT3 PDISC: PDIS3 (Bit 3)                                  */
#define PORT3_PDISC_PDIS3_Msk                 (0x8UL)                   /*!< PORT3 PDISC: PDIS3 (Bitfield-Mask: 0x01)                    */
#define PORT3_PDISC_PDIS4_Pos                 (4UL)                     /*!< PORT3 PDISC: PDIS4 (Bit 4)                                  */
#define PORT3_PDISC_PDIS4_Msk                 (0x10UL)                  /*!< PORT3 PDISC: PDIS4 (Bitfield-Mask: 0x01)                    */

